---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedTransparent.SurfaceRoughness
source: html/40c1fa72-3e49-4984-dabc-fe57f620e90b.htm
---
# Autodesk.Revit.DB.Visual.AdvancedTransparent.SurfaceRoughness Property

The property labeled "Roughness" from the "AdvancedTransparent" schema.

## Syntax (C#)
```csharp
public static string SurfaceRoughness { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".
 This property allows a connected asset.